[
  {
    "path": "posts/2022-04-20-post2/",
    "title": "post2",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Mia Fusillo",
        "url": "https://fusillomia.github.io/miaRBlog/"
      }
    ],
    "date": "2022-04-20",
    "categories": [],
    "contents": "\nbelow…\n\n\n\n\n\n\n",
    "preview": "posts/2022-04-20-post2/post2_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2022-04-20T16:58:33-05:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Mia's R Blog",
    "description": "Welcome to our new blog, My Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Mia Fusillo",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2022-04-20",
    "categories": [],
    "contents": "\nbelow is a graph …\n\n\n\n\n\n\n",
    "preview": "posts/welcome/welcome_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2022-04-20T15:31:24-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-04-20-time-series-forecasting-apple-revenue-with-holts/",
    "title": "Time Series: Forecasting Apple Revenue with Holt's",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Mia Fusillo",
        "url": "https://fusillomia.github.io/miaRBlog/"
      }
    ],
    "date": "2022-04-20",
    "categories": [],
    "contents": "\nPresentation for 3.9.2022 Data Viz Club\nThis document explores time series modeling practices in a business context.\nPackages\nWe will be using 2 packages in this blog in addition to tidyverse. fpp3 corresponds to the 3rd edition of a textbook, “Forecasting: Principles and Practice”. It is an extensive package in that it allows us to select a model from a variety, check assumptions, forecast, and plot forecasts. nortest is also used to check assumptions, specifically for Normality of residuals.\n\n\nlibrary(tidyverse)\nlibrary(fpp3)\nlibrary(nortest)\n\n\n\nData\nI have chosen a quarterly Apple revenue (in millions) dataset to work with. The data is from 2011 through 2021 and includes 44 periods. The data is from https://www.macrotrends.net/stocks/charts/AAPL/apple/revenue. I manually scraped the data into my own .csv for ease of foromatting. For larger datasets, scraping via programming would be a necessity.\nA tibble is the default tidyverse data table format. In the first chunk, I turned the data, named df for dataframe, into a time series tibble, or tsibble. To do this, I used add_column() to create a temporal variable to index upon. timequarter will be R’s frame of reference for analyzing revenue changes over time.\n\n\ndf <- read_csv(\"Apple_Revenue.csv\")\n\ndf <- df %>%\n  add_column(qtr=yearquarter(\"2011 Q1\") + 0:43, .before=TRUE) %>%\n  as_tsibble(index=qtr)\n\n\n\nRevenue vs Time\nIn this chunk, I plotted revenue against time. I turned the Qtr column into a factor class because R cannot color code based on a numeric variable (i.e. 1, 2, 3, 4), so turning these integers into factors will solve that issue.\n\n\ndf$Qtr <- as.factor(df$Qtr)\n\nggplot(df, aes(x=qtr, y=Revenue)) +\n  geom_line() +\n  geom_point(aes(color = Qtr)) +\n  scale_color_manual(values = c(\"blue\", \"purple\", \"orange\", \"darkgreen\"))\n\n\n\n\nLog Revenue vs Time\nIn this chunk, I plotted log revenue against time. I used mutate() to take the log of revenue and assign these values into a new column.\nThis plot looks very similar to revenue vs time. The difference is the scale of the y-axis. The variability decreased significantly. This is our goal because stabilizing the variance within the data will help with the accuracy of our forecasts.\n\n\ndf <- df %>% mutate(LogRevenue = log(Revenue))\n\nggplot(df, aes(x=qtr, y=LogRevenue)) +\n  geom_line() +\n  geom_point(aes(color = Qtr)) +\n  scale_color_manual(values = c(\"blue\", \"purple\", \"orange\", \"darkgreen\"))\n\n\n\n\nSeasonality\nIn this chunk, I sought to break down log revenue into its components and seasonally adjust the data.\nSTL() is a powerful function that will analyze the data and break it into 3 components: trend, seasonal, irregular. The trend is the pattern of the data. In the Apple dataset, the revenue vs time plot showed up that there is a persistent upward trend over time. For stocks, there might not be a trend in that the data tends to wander. The seasonal component is changes in the data due to the time of year, i.e. quarter. Apple revenue shows stark seasonality as revenue peaks every 4th quarter and then drops into the 1st quarter of the next year. On average, sale/revenue datasets that show seasonality peak in the 4th quarter. This makes sense because 4th quarter includes major holidays, like Black Friday and Christmas. People are buying gifts, splurging, trying to save on deals, etc. so spending is higher than the other 3 quarters. Lastly, the irregular component is the random shock in the data. This is analogous to error in a regression model.\nAfter breaking down revenue into these 3 components, I used add_column() again to add 2 columns to df. Season represents the seasonality component, affecting how revenue increases or decreases based on the quarter and year. LogA represents seasonally adjusted log revenue, that is log revenue without the seasonal indices found in Season.\n\n\ndf_stl <- df %>% model(STL(LogRevenue)) %>% components()\ndf <- df %>% add_column(Season = df_stl$season_year,\n                          LogA = df_stl$season_adjust)\n\nggplot(df, aes(x=qtr, y=Season)) +\n  geom_line() +\n  geom_point(aes(color = Qtr)) +\n  scale_color_manual(values = c(\"blue\", \"purple\", \"orange\", \"darkgreen\"))\n\n\n\n\nLogA vs Time\nIn this chunk, I plotted logA against time. As the plot demonstrates, the trend line is much smoother because it does not include drastic peaks affecting revenue due to seasonality. There are mini peaks and troughs throughout the trend line. These can be attributed to the irregular component. The graphical evidence for this is that the peaks/troughs occur in random quarters. If the peaks/troughs occurred in the same quarter each year, then that would mean that the STL component overestimated/underestimated seasonality. This is not the case, so we can be confident that STL did a good job.\n\n\nggplot(df, aes(x=qtr, y=LogA)) +\n  geom_line() +\n  geom_point(aes(color = Qtr)) +\n  scale_color_manual(values = c(\"blue\", \"purple\", \"orange\", \"darkgreen\"))\n\n\n\n\nFitting Holt’s Exponential Smoothing Model\nI have chosen to use Holt’s model because I have used it on similar datasets and it has done a nice job. It is a very flexible model suited to track trend and seasonality, which the Apple data has. In this blog, I check the assumptions to make sure the model did a good job. To be thorough, it would be important to go through a model selection process, i.e. looking at AIC, AICc, etc., before selecting a model and checking assumptions of residuals. Because my assumptions were satisfied, I decided to curb model selection for now.\nETS is the command to fit Holt’s model on LogA. ETS stands for ErrorTrendSeason, which is analogous to our 3 componenets. A stands for additive (as opposed to multiplicative) and N stands for none (since LogA is seasonally adjusted).\ngg_tsresiduals() plots a line graph of residuals about 0, acf, and a histogram. These help us determine if residuals are independent, non-autocorrelated, and Normal. The line graph seems to be random in that there is no pattern. The residuals are randomly distributed about 0. If residuals were successively positive or negative, this would indicate a pattern. Patterns in the residuals are not good because they tell us that the model did not extract the pattern from the raw data to the fullest extent. This means our forecasts do not paint the full picture and are consequently less accurate. The acf plot is very important for the same reasons. The first and fourth bars are the most important because they determine if residuals are autocorrelated with one quarter back or four quarters back (seasonality). These are not significant so residuals are not autocorrelated. The only bar that is significant can be attributed to the irregular component and this is normal to expect. Lastly, the histogram suggests that residuals approximate Normality. It certainly isn’t perfect as it’s right skewed, but we will test Normality to be sure later.\n\n\nETS <- df %>% model(ETS(LogA ~ error(\"A\") + trend(\"A\") + season(\"N\")))  \n\nETS %>% gg_tsresiduals()\n\n\n\n\nMODEL PARAMETERS\nGlance(), augment(), and components() are all functions that can be used on the ETS model output to estimate our parameters.\nAt the end of this chunk, I add the levels, slopes, forecasts, and residuals, to the dataframe.\n\n\n## glance is useful for finding sigma and model selection \nETS_g <- glance(ETS) \n\n## augment will give us our one-step ahead in-sample forecasts (fitted values)\nETS_a <- augment(ETS)\n\n## components will give us the levels and slopes\nETS_c <- components(ETS)\n\n\ndf <- df %>% add_column(level = ETS_c$level[2:45],\n                        slope = ETS_c$slope[2:45],\n                     forecast = ETS_a$.fitted,\n                    residuals = ETS_a$.resid)\n\n\n\nNORMALITY OF RESIDUALS\nChecking for Normality of residuals. p > 0.05, so residuals are Normally distributed. This tells us that our prediction intervals will be reliable.\n\n\nad.test(ETS_a$.resid)\n\n\n\n    Anderson-Darling normality test\n\ndata:  ETS_a$.resid\nA = 0.54817, p-value = 0.1495\n\nFORECASTING MEANS AND PREDICTION INTERVALS FOR 3 PERIODS AHEAD\nForecasting 3 periods into the future, including prediction intervals, using forecast() and hilo().\n\n\nETS_f <- ETS %>% forecast(h=3)\npred_int <- hilo(ETS_f)\nshow(pred_int)\n\n\n# A tsibble: 3 x 6 [1Q]\n# Key:       .model [1]\n  .model                qtr          LogA .mean                  `80%`\n  <chr>               <qtr>        <dist> <dbl>                 <hilo>\n1 \"ETS(LogA ~ erro… 2022 Q1 N(11, 0.0069)  11.4 [11.34023, 11.55335]80\n2 \"ETS(LogA ~ erro… 2022 Q2  N(11, 0.012)  11.5 [11.33755, 11.61510]80\n3 \"ETS(LogA ~ erro… 2022 Q3  N(12, 0.017)  11.5 [11.34106, 11.67068]80\n# … with 1 more variable: 95% <hilo>\n\nCALCULATING PREDICTION INTERVALS BY HAND\nCalculating mean and prediction interval by hand and matching with hilo output\n\n\n# Holt's Model for forecasting: Y_t = L_t-1 + B_t-1 + epsilon_t\n\n# Parameters\nreport(ETS)\n\n\nSeries: LogA \nModel: ETS(A,A,N) \n  Smoothing parameters:\n    alpha = 0.8341094 \n    beta  = 0.0001000008 \n\n  Initial states:\n     l[0]       b[0]\n 10.11958 0.02953884\n\n  sigma^2:  0.0069\n\n      AIC      AICc       BIC \n-46.55384 -44.97489 -37.63289 \n\nETS_g$sigma2 %>%\n  sqrt() \n\n\n[1] 0.083151\n\n# sigma 0.083151\n# alpha 0.8341094\n# beta 0.0001000008 \n\n### ONE-PERIOD AHEAD\nETS_c[45,] # level_44 11.43735; slope = 0.02953852  \n\n\n# A dable: 1 x 6 [1Q]\n# Key:     .model [1]\n# :        LogA = lag(level, 1) + lag(slope, 1) + remainder\n  .model                              qtr  LogA level  slope remainder\n  <chr>                             <qtr> <dbl> <dbl>  <dbl>     <dbl>\n1 \"ETS(LogA ~ error(\\\"A\\\") + tre… 2021 Q4  11.4  11.4 0.0295   -0.0595\n\n# 1.96*0.083151 # 0.162976\n# 11.41725 + 0.02953852 # 11.44679\n# 11.44679 + 0.162976 = 11.60976\n# 11.44679 - 0.162976 = 11.28381\n\npred_int[1,6]\n\n\n# A tibble: 1 × 1\n                   `95%`\n                  <hilo>\n1 [11.28382, 11.60976]95\n\n# a match\n\n\n\nIN SAMPLE OBSERVATIONS AND ONE STEP AHEAD FORECASTS FROM ETS AAN MODEL VS TIME\nPlotting in-sample observations and one-step ahead forecasts from ETS AAN model against Time\n\n\nggplot(df, aes(x=qtr, y=LogA)) +\n  geom_line(aes(y=LogA)) +\n  geom_line(aes(y=forecast, color = \"red\")) +\n  theme(legend.position=\"none\")\n\n\n\n\nFITTING A DETERMINISTIC MODEL\nComputing a deterministic model to show that it is inflexible compared to Holt’s.\n\n\ndf <- df %>% mutate(TimeSq = Time^2, .after=\"Time\")\ndet <- df %>% model(TSLM(LogA ~ Time + TimeSq))\ndet_t <- tidy(det)\nalpha <- det_t$estimate[1]\nbeta1 <- det_t$estimate[2]\nbeta2 <- det_t$estimate[3]\ndet_model <- alpha + beta1*df$Time + beta2*df$TimeSq\n\n\n\nIN SAMPLE OBSERVATIONS, ONE STEP AHEAD FORECASTS FROM ETS AAN MODEL, AND DETERMINISTIC MODEL VS TIME\nPlotting in-sample observations, one-step ahead forecasts from ETS AAN model, and deterministic model against Time\n\n\nggplot(df, aes(x=qtr, y=LogA)) +\n  geom_line(aes(x=qtr, y=LogA)) +\n  geom_line(aes(x=qtr, y=forecast), color = \"red\") +\n  geom_line(aes(x=qtr, y=det_model), color = \"blue\", lty=2) +\n  theme(legend.position=\"none\")\n\n\n\n\n\n\n\n",
    "preview": "posts/2022-04-20-time-series-forecasting-apple-revenue-with-holts/time-series-forecasting-apple-revenue-with-holts_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2022-04-20T17:04:45-05:00",
    "input_file": "time-series-forecasting-apple-revenue-with-holts.knit.md"
  }
]
